#pragma once
//user_interface.h
//Создатель: Покачалов М.Р.
//--------------------------------
//Используемые библиотеки:
#include <iostream>
#include <string>
#include <Windows.h>
#include <fstream>
#include <conio.h>
#include <vector>
#include "define_noun.h"
#include "transcription.h"
#include "out_work.h"
//--------------------------------

//Используемые пространства имен:
using namespace std;
//________________________________
	//Константные переменные, используемые для вывода "технического" текста:

	//Сообщение о неоткрывшемся файле 
const string file_err_mes = "\nНе удалось открыть выбранный файл.\n\
Пожалуйста, проверьте файл и перезапустите программу.\n\
Для завершения программы нажмите любую клавишу.";

//----------------------------------------------------------------------

//Используемые функции:

//функция для начала работы
void read_file(string file_name);

//функция проверки на то является ли символ разделителем
bool is_word_separator(char c);

//функция проверки на "инородные" символы
bool is_cyrillic(string word);

//функция определения конца предложения
bool is_sent_end(char c);
