#pragma once
//user_interface.h
//Создатель: Покачалов М.Р.
//--------------------------------
//Используемые библиотеки:
#include <iostream>
#include <string>
#include <Windows.h>
#include <conio.h>
#include <vector>
#include <filesystem>
#include <fstream>
#include "read_file.h"
//--------------------------------

//Используемые пространства имен:
using namespace std;
namespace fs = filesystem;
//________________________________

//Константные переменные, используемые для вывода "технического" текста:
//Приветственное сообщение
const string welcome_mes = "\t\t\tЗдравствуй, Уважаемый Пользователь!\n\n\
	Данная программа предназначена для поиска рифмующихся имён существительных в произвольном тексте.\n\
\n	На вход программа использует непустые файлы формата txt, расположенные в папке с данным приложением.\n\
	Перед использованием программы, проверьте наличие непустых текстовых файлов с текстом на русском языке.\n\
\n	При работе с программой следуйте появляющимся инструкциям.\n\
	Для начала работы программы нажмите на любую клавишу.";

//Сообщение о найденных файлах:
const string found_mes = "Программа нашла непустые текстовые файлы. \nДля перехода к выбору файла нажмите любую клавишу.";

//Сообщение об отсутствии непустых текстовых файл:
const string absent_mes = "Программа не нашла непустые текстовые файлы!\n\
Расположите непустые текстовые файлы рядом с программой и перезапустите её.\n\n\
Для завершения программы нажмите любую клавишу.";

//Сообщение о завершении работы алгоритма и уведомление о созданном выходном файле:
const string wrote_mes = "Обработка данного входного файла завершена.\n\
По результатам работы программы был сформирован файл ";

//Вопрос о дальнейших действиях:
const string after_wrote_mes = "Для перехода к выбору дальнейшего действия, нажмите любую клавишу.";

//Возможные действия:
const vector<string> actions_mes = { "Обработать ещё один файл","Завершить работу программы" };

//Текущий выбранный файл
const string act_elm = ">>";
// Остальные элементы
const string inact_elm = "  ";

//Инструкция по выбору файла
const string instruct_mes = "Для выбора используйте стрелки вверх-вниз.\n\
Для подтверждения выбора нажмите ENTER.\n\
Для завершения программы нажмите ESC.\n";

//Сообщение о выбранном файле
const string choose_file_mes = "Вы выбрали файл ";

//Сообщение о начале работы алгоритма
const string wait_mes = "\nПожалуйста, подождите, идёт обработка выбранного файла.";
//--------------------------------------------------------------------------------------------------------------

//Коды клавиш:
//ENTER
const int ENT = 13;

//UP ARROW
const int UP = 72;

//DOWN ARROW
const int DOWN = 80;

//SERVICE CODE
const int SERVICE = 224;

//ESC
const int ESC = 27;

//----------------------------------

//Служебные переменные
// 
// Список найденных файлов
vector<string> found_files;

//Переменная для продолжения работы программы
//Код 0 означает выбор файла и что все в порядке
//При ненулевом значении происходит завершение программы
int after_work_action = 0;

// 
// ----------------------------------

//Используемые функции:

//Функция для нахождения файлов:
bool find_files();

//Функция выбора элемента
int choose_menu(const vector <string>& arr, int n);