//user_interface.cpp
/*
Создатель: Покачалов М.Р.
-------------------------------------------------------------------------------------------
Данный код описывает модуль(блок) связанный с интерфейсом пользователя(консольный)
Порядок работы программы:
	1. Вывод приветствия и начало взаимодействия с программой
	2. Процедура выбора входного файла:
		2.1. Анализ папки с программой на наличие текстовых файлов
		2.2. Создание списка из имен непустых файлов
		2.3. Вывод имен файлов
		2.4. Предоставление пользователю возможности выбрать нужный (при помощи стрелок)
		2.5. Передача названия выбранного файла модулю (блоку) чтения файла

	После записи выходного файла получает "сигнал" от модуля (блока) записи выходного файл
	3. Вывод пользователю сообщения о том, что выходной файл сформирован ( + его название)
	4. Спросить у пользователя хочет ли он загрузить новый файл или завершить работу
--------------------------------------------------------------------------------------------*/

//подключаемые файлы:
#include "user_interface.h"
//---------------------------------

//Функция нахождения файлов
//Является булевой функцией. В случае нахождения файлов возвращает true.
//Имена найденных файлов записываются в глобальный список.
bool find_files()
{
	for (const auto& entry : fs::directory_iterator(fs::current_path()))
	{
		if (fs::is_regular_file(entry.path()) && entry.path().extension() == ".txt")
			// Проверяем размер файла, чтобы определить наполненность файла
			if (fs::file_size(entry.path()) > 0)
				found_files.push_back(entry.path().filename().string());
	}

	if (found_files.size() != 0)
		return true;
	else
		return false;
}

//Функция для выбора при помощи стрелок вверх-вниз файла для обработки
//Получает список в виде вектора и номер текущего выбранного элемента
//Возвращает выбранный индекс
int choose_menu(const vector <string>& arr, int n = 0)
{
	int ch;
	int size = arr.size();

	do
	{
		system("cls");
		cout << instruct_mes << endl;
		for (int i = 0; i < size; i++)
		{
			//Текущий выбранный элемент выделяем
			if (i == n)
				cout << act_elm;
			else
				cout << inact_elm;

			cout << i + 1 << ". " << arr[i] << endl;
		}
		ch = _getch();

		if (ch == SERVICE)
		{
			ch = _getch();

			//При нажатии кнопки вверх понижаем индекс (смещаемся вверх)
			if (ch == UP)
				n--;
			//И наоборот
			else if (ch == DOWN)
				n++;

			n = (n + size) % size;
		}

		if (ch == 27)
		{
			after_work_action = 1;
			return n;
		}

	} while (ch != ENT);

	return n;
}

//Основная функция
int main()
{
	//установка кодировки для использования русского языка 
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	//Вывод приветствия
	cout << welcome_mes;

	//Переменная для хранения нажатой клавиши 
	int ch;
	ch = _getch();

	//Переменная для выбранного индекса файла 
	int selected_file = 0;

	//Если найдены непустые текстовые файлы предоставляем пользователю возможность работать
	if (find_files())
	{
		while (after_work_action == 0)
		{
			system("cls");

			//Уведомление, что файлы найдены
			cout << found_mes << endl;
			ch = _getch();

			//Выбор обрабатываемого файла
			selected_file = choose_menu(found_files, selected_file);

			//Если было выбрано завершение программы, то не идем дальше
			if (after_work_action == 0)
			{
				system("cls");

				//Сообщение о выбранном файле и начале обработки
				cout << choose_file_mes << found_files[selected_file] << endl;
				cout << wait_mes << endl;

				//Передача управления модулю чтения файла
				string f_out = read_file(found_files[selected_file]);
				if (f_out != "error")
					after_work_action = 0;

				//если не была получена ошибка, то говорим о созданном файле
				if (after_work_action == 0)
				{
					//Получение имени выходного файла
					string out_file_name = f_out;

					//После обработки сообщаем о том, что всё готово и нужно выбрать дальнейшее действие
					system("cls");
					cout << wrote_mes << out_file_name << endl;
					cout << after_wrote_mes << endl;

					ch = _getch();

					//Даем пользователю выбрать дальнешие действия: новый файл или завершить
					after_work_action = choose_menu(actions_mes, after_work_action);
				}
			}
		}
	}
	//В противном случае говорим, что нужно добавить файлы и перезапустить 
	else
	{
		cout << absent_mes;
		ch = _getch();
	}

	return 0;
}